'''
Задача 1
Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
'''
for i in range(1, 6, 1):
   print(i,'00000000000000000', sep='.')
print('_____________________________________________________')
# или
i = 1
while i < 6:
    print(i, '000000000000000', sep='.')
    i = i + 1